[
  {
    "id": 1,
    "nclass": "aboutme",
    "title": "Обо мне",
    "content": {
      "textBefore": "Привет, я Андрей - разработчик на Golang из Москвы.\nС юного возраста я увлекался технологиями и программированием, затем последовало 18 лет промышленной разработки. В итоге всё это привело меня к выбору Golang как моего основного инструмента. Я глубоко погружаюсь в изучение Go, стремясь к тому, чтобы мои проекты были не только функциональными, но и эффективными и масштабируемыми. Моя любовь к разработке и стремление к постоянному обучению приводят меня к участию в проектах, где я могу применять свои навыки и расширять их. Я мечтаю работать над проектами, которые имеют значимое влияние на общество или бизнес, и где я могу расти вместе с командой. Я ценю качество кода, чистую архитектуру и хорошее общение в команде. Моя цель - создавать продукты, которые решают реальные проблемы и вносят положительный вклад в окружающий нас мир.",
      "iclass": "",
      "items": []
    },
    "isActive": false
  },
  {
    "id": 2,
    "nclass": "skills",
    "title": "Опыт",
    "content": {
      "textBefore": "I work in such technologies as",
      "iclass": "cards",
      "items": [
        {
          "id": 1,
          "src": "/icons/technology/golang.png",
          "alt": "Golang",
          "rating": 1
        },
        {
          "id": 2,
          "src": "/icons/technology/postgresql.png",
          "alt": "PostgreSQL",
          "rating": 2
        },
        {
          "id": 3,
          "src": "/icons/technology/docker.png",
          "alt": "Docker",
          "rating": 3
        },
        {
          "id": 4,
          "src": "/icons/technology/git.png",
          "alt": "Git",
          "rating": 4
        }
      ],
      "isActive": true
    }
  },
  {
    "id": 3,
    "nclass": "portfolio",
    "title": "Портфолио",
    "content": {
      "textBefore": "",
      "iclass": "projects",
      "items": [
        {
          "id": 1,
          "title": "Менеджер паролей GophKeeper",
          "descr": "GophKeeper - это система управления паролями, разработанная на Go, которая обеспечивает безопасное и удобное хранение личной информации.Проект включает в себя клиент-серверную архитектуру, позволяющую пользователям регистрироваться, аутентифицироваться и авторизовывать доступ к своим данным.GophKeeper поддерживает синхронизацию данных между клиентами и обеспечивает безопасность передачи и хранения информации.Клиент GophKeeper представляет собой CLI-приложение, доступное для Windows, Linux и Mac OS, что обеспечивает удобство использования на различных платформах.Проект включает в себя функции для создания, редактирования и удаления данных, а также для выбора хранилища и формата хранения данных.GophKeeper также предлагает гибкость в выборе механизмов аутентификации и авторизации, обеспечивая высокий уровень безопасности.Проект покрыт юнит-тестами, подтверждающими его надежность и стабильность.Этот проект демонстрирует мои навыки в разработке на Go, а также мою способность создавать сложные и функциональные системы, которые решают реальные задачи пользователей.",
          "hrefs": [
            "https://github.com/wurt83ow/gophkeeper-client",
            "https://github.com/wurt83ow/gophkeeper-server"
          ]
        },
        {
          "id": 2,
          "title": "Накопительная система лояльности «Гофермарт»",
          "descr": "\"Гофермарт\" - это накопительная система лояльности, разработанная на Golang, предназначенная для улучшения взаимодействия с клиентами интернет-магазина \"Гофермарт\".Система обеспечивает регистрацию и аутентификацию пользователей, приём и обработку номеров заказов, а также управление накопительным счётом лояльности.С помощью уникальной интеграции с внешней системой расчёта баллов лояльности, \"Гофермарт Лояльность\" позволяет пользователям накапливать и использовать баллы для оплаты покупок, создавая эффективную и удобную систему лояльности.",
          "hrefs": ["https://github.com/wurt83ow/gophermart"]
        },
        {
          "id": 3,
          "title": "Сервис сокращения URL «Tinyurl»",
          "descr": "\"Tinyurl\" - это сервис сокращения URL, разработанный на Golang, предназначенный для упрощения и ускорения доступа к веб-ресурсам.Проект демонстрирует применение широкого спектра технологий и пакетов Golang, включая работу с HTTP, чтение аргументов командной строки, логирование, сериализацию и десериализацию данных, сжатие данных, взаимодействие с файловой системой, управление временем выполнения и базами данных SQL.Сервис обеспечивает безопасность информации с помощью хеширования и криптографии, поддерживает многопоточность для обработки большого количества запросов, и использует паттерны проектирования и антипаттерны для обеспечения качества кода.Проект также включает профилирование для оптимизации производительности, стилизацию для улучшения пользовательского опыта и тщательную документацию для облегчения понимания и поддержки кода.",
          "hrefs": ["https://github.com/wurt83ow/tinyurl"]
        },
        {
          "id": 4,
          "title": "Portfolio - текущая страница",
          "descr": "\"Portfolio\" - это веб-проект, сочетающий в себе клиентскую часть, разработанную на React, и бэкенд, реализованный на Golang. Проект использует MongoDB в качестве базы данных для хранения и обработки данных, а веб-сервер Nginx обеспечивает высокую производительность и надежность. Для развертывания и управления проектом используется Docker, позволяя запускать приложение в трех контейнерах: portfolio_server_nginx для обработки входящих HTTP-запросов, mongo для работы с базой данных, и portfolio_server_backend для обработки бизнес-логики на стороне сервера. Развертывание проекта осуществляется на виртуальной машине в Яндекс.Облаке, что обеспечивает масштабируемость и надежность инфраструктуры. ",
          "hrefs": [
            "https://github.com/wurt83ow/portfolio_server",
            "https://github.com/wurt83ow/portfolio_client"
          ]
        }
      ]
    }
  },
  {
    "id": 4,
    "nclass": "contacts",
    "title": "Contacts",
    "content": {
      "textBefore": "Want to know more or just chat?\nYou are welcome!",
      "btnText": "Send message",
      "iclass": "socialIcons",
      "items": [
        {
          "id": 1,
          "src": "/icons/contacts/linkedIn.png",
          "alt": "linkedIn",
          "hrefs": ["https://github.com/"]
        },
        {
          "id": 2,
          "src": "/icons/contacts/github.png",
          "alt": "github",
          "hrefs": ["https://github.com/"]
        },
        {
          "id": 3,
          "src": "/icons/contacts/telegram.png",
          "alt": "telegram",
          "hrefs": ["https://t.me/drstein77"]
        }
      ],
      "textAfter": "Like me on\nLinkedIn, github, telegram",
      "isActive": true
    }
  }
]
